%画出茎叶图
%双谱线插值，用于求必做基波及谐波的平均频率、幅值、相位

clc;
clear all;
wave = xlsread('3_9.csv'); %load 数据
s=wave(400:8591,2);%一共8192个
fs=10000; %采样率
N=length(s);%采样点数
n=0:N-1;
w=0.5-0.5*cos(2*pi*(n)/N);%汉宁窗
r=s.*w';%对原信号加窗
%w'表示取共轭
%a.*b表示矩阵a中的元素与矩阵b中的元素按位置依次相乘，得到的结果将作为新矩阵中相同位置的元素
v=fft(r,N);%进行FFT，返回N点的DFT
vz=(abs(v)/N)*2*2;%求幅值并修正，修正系数为2
u=abs(v);
stem(vz);%画出FFT后信号的茎状图，用于判断k0、k1、k2

A=zeros(1,30);%用于后面存储各谐波幅值
F=zeros(1,30);%用于后面存储各谐波频率
P=zeros(1,30);%用于后面存储各谐波相位
freq=zeros(1,30);%用于后面存储次数

%以下步骤为双峰谱线插值修正算法
M=11;%事先通过前面的茎状图发现基波位于u(11)
for I=0:29 %I+1对应谐波系数，由于只含有小于30次的谐波，故在29截止即可
    %选择双谱线
    if(u(M-1+(M-1)*I) > u(M+1+(M-1)*I))
        k1=M-1+(M-1)*I;
        k2=M+(M-1)*I;
    else 
        k1=M+(M-1)*I;
        k2=M+1+(M-1)*I;
    end
    y1 = u(k1);
    y2 = u(k2);
    %插值法
    b=(y2-y1)/(y2+y1);%相当于参考文献中的参数β
    a=1.5*b;%相当于参考文献中的参数α
    k0=k1-1+a+0.5;
    A(I+1)=(y1+y2)*(2.35619403+1.15543628*a^2+0.32607873*a^4+0.07891461*a^6)/N;
    F(I+1)=k0*fs/N;%频率不需要修正
    P(I+1)=(angle(v(11+10*I))+pi/2-pi*(a-(-1)*0.5))/pi*180;
end

for i=1:29
    for j=1:29
         if (F(i)/F(1)>=j*0.98) && (F(i)/F(1)<=j*1.02)% 只有误差在基波频率的j倍的98%-102%以内才算谐波
             freq(i)=j;
         end
    end
end

total=[freq;A;F;P];
display(total);
xlswrite('加分二谐波分析.csv',total');